clc; clear all
f1=@(t,x1,x2)x2;%1-е уравнение системы
f2=@(t,x1,x2)4*t-3*t*x2-x1;%2-е уравнение системы
X=[1;1];%начальные условия
h=0.1;%шаг
x1=[X(1)];
x2=[X(2)];
t=0:h:1;%интервал времени
N=length(t);
for n=1:N-1 % явный метод Эйлера
    x1(n+1)=x1(n)+0.5*h*f1(t(n),x1(n),x2(n));
     x2(n+1)=x2(n)+0.5*h*f2(t(n),x1(n),x2(n));
end
x=x1(end)
%точное решение
[s,u]=ode45(@s_du,[0 1],[1 1]);
x_n=u(end,1)
plot(t,x1,s,u(:,1),'--')
grid on
legend('Метод Эйлера','Точное решение')
eps1=abs(x-x_n)/abs(x)*100

