clc; clear all
A = [0 1 0;
    0 0 1;
    -81000 -350 -35];
B = [ 0;
    0;
    40000];

X = [0;0;0]; % начальные условия
h = 0.00001; % шаг
t = 0:h:1; % интервал времени
N = length(t);
Xs = zeros(3, N); % предварительное выделение памяти для массива состояний
Xs(:,1) = X;

for n = 1:4 % явный метод Эйлера
    Xs(:,n+1) = Xs(:,n) + h*(A*Xs(:,n)+B);
end

for n = 4:N-1 % матричный метод Адамса
    Xs(:,n+1) = Xs(:,n) + (h/12)*(23*(A*Xs(:,n)+B) - 16*(A*Xs(:,n-1)+B)+  5*(A*Xs(:,n-2)+B));
end

figure(1); % добавленная команда
plot(t, Xs(2,:));
legend('Импульсно-Переходная');
grid on;
xlabel('t');
ylabel('k(t)');
figure(2);
plot(t, Xs(1,:))
legend('Переходная');
xlabel('t');
ylabel('h(t)');