A = [0 1 0;
    0 0 1;
    -81000 -350 -35];
syms x1 x2 x3;
X = [x1;x2;x3];
B = [ 0;
    0;
    40000];

Y=A*X + B;
f = matlabFunction(Y);
f1=@(t,x1,x2,x3)x2; % 1-е уравнение системы
f2=@(t,x1,x2,x3)x3; % 2-е уравнение системы
f3=@(t,x1,x2,x3)40000 - 350*x2 - 35*x3 - 81000*x1; % 3-е уравнение системы
X=[0;0;0]; % начальные условия
h=0.01; % шаг
x1=[X(1)];
x2=[X(2)];
x3=[X(3)];
t=0:h:0.4; % интервал времени
N=length(t);
for n=1:N-1 % явный метод Эйлера
    x1(n+1)=x1(n)+h*f1(t(n),x1(n),x2(n),x3(n));
    x2(n+1)=x2(n)+h*f2(t(n),x1(n),x2(n),x3(n));
    x3(n+1)=x3(n)+h*f3(t(n),x1(n),x2(n),x3(n));
end
x=x1(end);
% точное решение
plot(t,x2,t,x1,'--');

grid on;
legend('x2','x1');